import React, { Component } from "react";
import CaruselBox from "../components/CaruselBox";
import { Container, Card, Row } from "react-bootstrap";

import volunteer from '../assets/volunteer.jpg';
import volunteerWithDog2 from '../assets/volunteerWithDog2.jpg';
import bud1 from '../assets/bud-1.jpg';

export default class Home extends Component {
    render() {
        return (
            <>
                <CaruselBox />
                <Container>
                    <h2 className="text-center m-4" ></h2>
                    <Row md={3} className="m-4">
                        <Card >
                            <Card.Img
                                variant="top"
                                src={volunteer}
                            />
                            <Card.Body>
                                <Card.Title>Волонтерство</Card.Title>
                                <Card.Text>
                                    Нам всегда нужны ответсвенные люди-добровольцы для помощи в уходе и кормлении животных,а также в организации благотворительных сборов корма.
                                    Кроме того нам часто требуется помощь с передержкой собак
                                </Card.Text>
                            </Card.Body>
                        </Card>

                        <Card>
                            <Card.Body>
                                <Card.Title>Будни приюта</Card.Title>
                                <Card.Text>
                                    Приют Домик Надежды - это место, куда попадают израненные собаки 🐕 после ДТП, изрезанные или прострелянные живодерами и садистами, выброшенные из окон, избитые и заморенные голодом.
                                    Мы лечим несчастных животных, социализируем их и ищем собакам новый дом. Но к сожалению за годы нашей работы в приюте так и остались жить десятки собак, которые уже никогда не найдут себе хозяев. Без ног, без глаз, хвостов и ушей, старые и больные. Они навсегда останутся в приюте.
                                    Тимвилль - это сто процентов волонтерский проэкт. Мы не получаем никаких дотаций от государства! И самое главное, что нас всего три с половиной человека. Погладить животных нет времени, надо работать. Но они ждут именно ласки и внимания.
                                    Друзья, приезжайте к нам в приют!
                                </Card.Text>
                            </Card.Body>
                            <Card.Img
                                variant="top"
                                src={bud1}
                            />
                        </Card>

                        <Card>
                            <Card.Img
                                variant="top"
                                src={volunteerWithDog2}
                            />
                            <Card.Body>
                                <Card.Title>Давай знакомиться</Card.Title>
                                <Card.Text>
                                    Мы - приют для добрых, чудесных, но, к сожалению, брошенных хозяевами собак. В нашем приюте нет клеток и цепей. Собаки проживают в больших вольерах. Обязательное дежурство каждый день! Уборка, кормёжка и выгул. Волонтеры стараются создавать комфортные условия для своих подопечных.
                                    В приюте собакам хорошо, но это не дом. Любой наш питомец мечтает о своем доме, о человеке, который будет его любить и заботится о нем. Приезжайте к нам, выбирате себе самого преданного друга!
                                </Card.Text>
                            </Card.Body>
                        </Card>
                    </Row>
                </Container>
            </>
        );
    }
}